{"recipes":[{"id":0,"@context":"http://schema.org","@type":"Recipe","name":"Smashed and Loaded Crispy Potatoes","image":"https://assets.bonappetit.com/photos/5c1bdcf72efb8f2d33e39588/16:9/w_1000,c_limit/Basically-Crispy-Potatoes-01.jpg","author":{"@type":"Person","name":"Molly Baz"},"publisher":{"@type":"Organization","name":"Bon Appétit","logo":{"@type":"ImageObject","url":"https://www.bonappetit.com/images/logo-foodculture-tablet@1x.png","width":322,"height":56}},"datePublished":"2018-12-23T04:00:00.000-05:00","dateCreated":"2019-11-16T06:35:00.000-05:00","description":"Cooking potatoes twice—once in water, and a second time in hot oil—is hands-down the best way to achieve extra-crispy potatoes at home.","recipeYield":"4 servings","recipeIngredient":["2 lb. fingerling or other small (1½\"-diameter) potatoes","Kosher salt","1 2-oz. piece Parmesan","1 large bunch chives","½ cup sour cream","2 Tbsp. hot sauce","5 oz. bacon","4 Tbsp. extra-virgin olive oil, divided","Freshly ground black pepper"],"recipeInstructions":[{"@type":"HowToStep","text":"Place 2 lb. potatoes in a large pot and cover with water by 2\". Add 3 large fistfuls of salt and heat over medium-high. Taste the water! It should be real salty, almost like seawater. If not, add more. Bring to a simmer. While you're waiting for the water to simmer, go ahead and get some prep work out of the way."},{"@type":"HowToStep","text":"Finely grate 2 oz. Parmesan with a Microplane into a medium bowl."},{"@type":"HowToStep","text":"Thinly slice 1 large bunch chives and transfer to a small bowl."},{"@type":"HowToStep","text":"Combine ½ cup sour cream and 2 Tbsp. hot sauce in another small bowl. Add a teaspoon or two of water to thin it out to drizzlable consistency."},{"@type":"HowToStep","text":"Line a plate with paper towels. Place 5 oz. bacon in a large 12\" cast-iron skillet in as even a layer as possible and heat over medium. (We like starting bacon in a cold pan and gradually heating it—less sputtering, more crispy.) Cook until crispy on one side, 3–4 minutes. Turn with a fork and continue to cook until very crisp, 3–4 minutes more. Transfer to paper towel-lined plate to drain. Reserve the bacon-y skillet—and all of that fat!—for cooking the potatoes later on."},{"@type":"HowToStep","text":"It’s time to check on those potatoes. Once the potatoes come to a simmer, they need to cook until a fork or paring knife easily slides into one without much resistance, 6–10 minutes. This will really vary depending on what size and type of potato you're cooking, so keep checking them periodically for doneness. (When in doubt, cut one open and give it a taste!) Be sure not to cook them too long or they will get logged with water and fall apart. Drain potatoes and transfer to a large rimmed baking sheet or a cutting board. Let cool slightly, about 3 minutes."},{"@type":"HowToStep","text":"Using the bottom of a measuring cup or flat bottomed mug, smash each one gently by pressing down evenly—you want them to have flat surfaces so they'll crisp nicely, but you want them to remain mostly intact. (Some will break into more than one piece; don't worry about it!)"},{"@type":"HowToStep","text":"Heat reserved bacon skillet over medium. If the pan isn't fully coated with bacon fat, add a good drizzle of oil—you want to make sure that there's enough fat in the pan at all times so that each potato gets a piece of the action. Arrange half of potatoes in a single layer in skillet. Season with salt and cook, undisturbed, until golden brown and crisp underneath, 6–7 minutes. Flip with a metal spatula, add 2 Tbsp. oil, and continue to cook on opposite side until golden brown and edges are crisp, 5–6 minutes more. Transfer to a platter. Heat remaining potatoes and 2 Tbsp. oil in skillet over medium. Season with salt and repeat browning and flipping process, adding more oil if the pan gets dry."},{"@type":"HowToStep","text":"While second batch cooks, you can begin loading your potatoes. Crumble bacon with your fingers and scatter half over potatoes. Sprinkle half of Parmesan over. Drizzle sour cream sauce over. Sprinkle half of chives evenly over."},{"@type":"HowToStep","text":"When second batch of potatoes is finished cooking, transfer to platter and repeat loading process with remaining bacon, Parmesan, sour cream, and chives. Season with pepper and serve."}],"nutrition":""},{"id":3,"@context":"http://schema.org","@type":"Recipe","name":"Butter Pecan Skillet Cookies","image":"https://assets.bonappetit.com/photos/5dc5890d4151fc000875a316/16:9/w_1000,c_limit/1219-COOKIES-Butter-Pecan-Skillet.jpg","author":{"@type":"Person","name":"Rick Martinez"},"publisher":{"@type":"Organization","name":"Bon Appétit","logo":{"@type":"ImageObject","url":"https://www.bonappetit.com/images/logo-foodculture-tablet@1x.png","width":322,"height":56}},"datePublished":"2019-11-19T04:00:00.000-05:00","dateCreated":"2019-11-13T07:04:00.000-05:00","description":"It looks like cake. It tastes like butter pecan ice cream. You don’t need a baking sheet to make it. But don’t let anyone try to call you out on a technicality—one bite and it’s clear this big sliceable round boy is all cookie. Maple-syrup-glazed pecans in the dough lend nutty depth, then get sprinkled on top with sugar for an icicles-on-tree-branches vibe sure to freeze out the cookie swap competition.","recipeYield":"Makes about 16","recipeIngredient":["1⅓ cups (160 g) chopped pecans","4 Tbsp. pure maple syrup","2 tsp. kosher salt, divided","10 Tbsp. chilled unsalted butter, cut into pieces, plus more for pan","1¼ cups (160 g) all-purpose flour","6 Tbsp. (packed; 75 g) light brown sugar","1 large egg","1 Tbsp. plus 1 tsp. vanilla extract or vanilla bean paste","1 cup (120 g) powdered sugar","3 Tbsp. (or more) whole milk","Coarse white sanding sugar and edible glitter (for decorating)"],"recipeInstructions":[{"@type":"HowToStep","text":"Place a rack in middle of oven; preheat to 350°. Toss pecans, maple syrup, and ½ tsp. salt in a medium bowl. Scrape onto a rimmed baking sheet lined with a silicone baking mat or parchment paper and spread nuts into a single layer. Bake until pecans are slightly darkened and syrup is dark and bubbling, 15–20 minutes. Remove from oven and carefully toss pecans in hot syrup to coat again. Let cool on baking sheet until caramel hardens, about 30 minutes. Break up candied pecans into pieces; discard any burned bits."},{"@type":"HowToStep","text":"Reduce oven temperature to 325°. Generously butter a 10\" cast-iron or stainless-steel skillet; line bottom with a round of parchment paper and butter parchment. Pulse flour, brown sugar, half of candied pecans, and 1¼ tsp. salt in a food processor until nuts are finely chopped. Add egg, 1 Tbsp. vanilla, and remaining 10 Tbsp. butter and process until a shaggy dough forms."},{"@type":"HowToStep","text":"Transfer dough to a large bowl and knead a couple of times just to bring it together. Using damp hands, pat dough evenly into skillet, extending all the way to the sides of the pan. Bake cookie until edges are golden brown and center is slightly puffed, 30–35 minutes. Let cool in skillet 1 hour. Invert cookie onto a cutting board and cut into 16 wedges. Turn right side up and transfer to a wire rack set inside a rimmed baking sheet."},{"@type":"HowToStep","text":"Whisk powdered sugar, milk, remaining ¼ tsp. salt, and remaining 1 tsp. vanilla in a small wide bowl until smooth. The glaze should be the consistency of heavy cream; thin with more milk if needed. Transfer half of the glaze to another small wide bowl (you’ll need to use 2 bowls as the glaze will start to collect crumbs and you’ll want a fresh start)."},{"@type":"HowToStep","text":"Working one at a time, lightly dip half of the wedges, top side down, into first bowl of glaze so that only the surface is covered and no glaze drips down the sides. Use a toothpick to pop any bubbles and smooth glaze; coating should be thin enough to see the cookie peeking through. Repeat with remaining wedges and second bowl of glaze."},{"@type":"HowToStep","text":"Top wedges with remaining candied pecans and let sit 10 minutes. Sprinkle with sanding sugar and glitter and let sit until glaze is set, about 1 hour."},{"@type":"HowToStep","text":"Do Ahead: Cookies can be baked 1 day ahead. Store airtight at room temperature."}],"nutrition":""},{"id":4,"@context":"http://schema.org","@type":"Recipe","name":"Black-and-White-and-Green Cookies","image":"https://assets.bonappetit.com/photos/5dc5890d05a0e40008743ef6/16:9/w_1000,c_limit/1219-COOKIES-Black-white-green.jpg","author":{"@type":"Person","name":"Rick Martinez"},"publisher":{"@type":"Organization","name":"Bon Appétit","logo":{"@type":"ImageObject","url":"https://www.bonappetit.com/images/logo-foodculture-tablet@1x.png","width":322,"height":56}},"datePublished":"2019-11-19T06:00:00.000-05:00","dateCreated":"2019-11-13T06:58:00.000-05:00","description":"This is a play on two of our favorite classics: the Thin Mint and New York City’s iconic black-and-white cookie. But here we’re upping the game with finely chopped fresh mint mixed right into the dough for both its lovely green color and fresher-than-Dentyne flavor. Then comes the drama: geometric swipes of white sanding sugar and dark melted chocolate. The mint flavor will intensify as the cookies sit; make ahead if that’s your thing.","recipeYield":"Makes about 24","recipeIngredient":["2 tsp. baking powder","2½ cups (320 g) all-purpose flour, plus more for dusting","1½ tsp. kosher salt, plus more","2 cups (packed; 45 g) mint leaves","1 cup (200 g) granulated sugar","1¼ cups (2½ sticks) unsalted butter, room temperature","1 large egg","1 large egg yolk","Coarse white sanding sugar or Swedish pearl sugar (for decorating)","1 cup (120 g) powdered sugar","2 Tbsp. (20 g) Dutch-process or unsweetened cocoa powder","1 Tbsp. light corn syrup","A 3\"-diameter cookie cutter"],"recipeInstructions":[{"@type":"HowToStep","text":"Whisk baking powder, 2½ cups flour, and 1½ tsp. salt in a medium bowl to combine. Pulse mint and granulated sugar in a food processor until mint is finely chopped. Add butter; process to combine. Add dry ingredients and pulse again to combine. Add egg and egg yolk; pulse until a shaggy dough forms."},{"@type":"HowToStep","text":"Turn out dough onto a lightly floured surface and knead just until dough holds its shape. Divide dough in half; pat each portion into a 1\"-thick disk. Wrap disks in plastic and chill until firm, at least 2 hours."},{"@type":"HowToStep","text":"Place racks in upper and lower thirds of oven; preheat to 350°. Working with 1 disk at a time, roll out dough on a lightly floured sheet of parchment paper to about ¼\" thick, dusting with more flour as needed to keep from sticking. Punch out rounds with lightly floured cookie cutter and arrange on 2 parchment-lined baking sheets, spacing 1\" apart. Pat dough scraps into a 1\"-thick disk. Wrap in plastic and chill 10 minutes if soft. Repeat process with scraps."},{"@type":"HowToStep","text":"Hold a bench scraper or straightedge upright 1\" from edge of a cookie to cordon off a shallow semicircle (do not press down into dough; you’re just making a barrier). Coat semicircle with sanding sugar; gently press to adhere. Remove scraper; you should have a tidy sugared edge. Repeat with remaining cookies and more sanding sugar."},{"@type":"HowToStep","text":"Bake cookies, rotating baking sheets top to bottom and back to front halfway through, until edges are lightly browned, 10–12 minutes. Let cool 10 minutes on baking sheets, then transfer to 2 wire racks set inside 2 rimmed baking sheets; let cool completely."},{"@type":"HowToStep","text":"Sift powdered sugar and cocoa powder into a medium bowl. Add corn syrup, a pinch of salt, and 2 Tbsp. warm water and stir until smooth and glossy."},{"@type":"HowToStep","text":"Position bench scraper to make another shallow semicircle on the other side of the cookie, angling it so that it forms a V with the sugared edge, lightly pressing scraper into cookie to make a barrier. Spoon 1 tsp. glaze onto exposed semicircle and use a toothpick to help coat evenly; excess will drip over sides. Lift scraper straight up and over chocolate side to create a neat edge. Repeat with remaining cookies and glaze. Let sit until glaze is set, at least 2 hours."},{"@type":"HowToStep","text":"Do Ahead: Dough can be made 1 month ahead; freeze. Thaw in refrigerator before using. Cookies can be baked 1 day ahead; store tightly wrapped on a rimmed baking sheet at room temperature."}],"nutrition":""},{"id":5,"@context":"http://schema.org","@type":"Recipe","name":"Sichuan Boiled Fish","image":"https://assets.bonappetit.com/photos/5dcc491778424400093de249/16:9/w_1000,c_limit/Lunar-New-Year-Sichuan-Boiled-Fish.jpg","author":{"@type":"Person","name":""},"publisher":{"@type":"Organization","name":"Bon Appétit","logo":{"@type":"ImageObject","url":"https://www.bonappetit.com/images/logo-foodculture-tablet@1x.png","width":322,"height":56}},"datePublished":"2019-11-19T04:00:00.000-05:00","dateCreated":"2019-11-19T07:30:00.000-05:00","description":"The flavors of this fish are out of control—super spicy, super intense, super delicious. This recipe moves fast, though, so stay on top of it by prepping and lining up your ingredients before you start cooking. This recipe is from Taiwanese-American cook Lisa Cheng Smith’s spectacular Lunar New Year feast. ","recipeYield":"8 regular or 16 small servings","recipeIngredient":["1 large egg white","¼ cup rice wine","2 Tbsp. cornstarch","2 tsp. finely grated peeled ginger","1 tsp. kosher salt","½ tsp. freshly ground white pepper (optional)","2 tsp. ground Sichuan peppercorns (from 3 tsp. whole), divided","1 lb. skinless, boneless white fish fillets (such as cod, flounder, or red snapper)","6 Tbsp. grapeseed or vegetable oil, divided","3 celery stalks, sliced into 3\"-long matchsticks","½ cup bean sprouts","⅓ cup dried Sichuan chiles (about 32) or other red Chinese chiles, divided","7 garlic cloves, 6 smashed, coarsely chopped, 1 finely chopped","1 3\" piece ginger, peeled, thinly sliced (about 5 slices)","2 tsp. whole Sichuan peppercorns, divided","3 Tbsp. doubanjiang (Sichuan-style fermented chili bean paste)","2½ cups fish stock, low-sodium chicken broth, or water","2 scallions, thinly sliced on a diagonal","2 sprigs cilantro, sliced into 2\" pieces (stems and leaves)","2 tsp. gochugaru (fine Korean red pepper powder)","1 tsp. sesame seeds"],"recipeInstructions":[{"@type":"HowToStep","text":"Whisk egg white, wine, cornstarch, grated ginger, salt, white pepper (if using), and 1 tsp. ground Sichuan peppercorns in a medium bowl. Thinly slice fish fillets on a diagonal into ¼\" slices and place in bowl with marinade. Toss to coat and let sit 30 minutes while you make the broth."},{"@type":"HowToStep","text":"Heat 1 Tbsp. oil in a large wok or deep-sided skillet over medium-high. Add celery and bean sprouts and stir-fry, stirring constantly, until crisp-tender, about 1 minute. Transfer to a large deep bowl."},{"@type":"HowToStep","text":"Remove seeds from 6 dried chiles and cut crosswise into ¼\" pieces. Pour 1 Tbsp. oil into same wok and heat over medium-high. Add coarsely chopped garlic, sliced ginger, sliced dried chiles, 6 whole dried chiles, 1 tsp. whole Sichuan peppercorns and cook, stirring, until fragrant, about 1 minute. Add bean paste and cook, stirring, until fragrant, about 1 minute. Pour in stock and add remaining 1 tsp. ground Sichuan peppercorns. Bring to a boil. Reduce heat to medium-low, cover wok (use a baking sheet if you don’t have a lid), and simmer 15 minutes to infuse broth with flavor."},{"@type":"HowToStep","text":"Using your hands, lift fish out of marinade, shaking to remove excess, and transfer to hot broth; discard marinade. Cook over medium-low until just opaque, about 2 minutes. Using a spider or slotted spoon, transfer fish to bowl with celery and bean sprouts, arranging on top; carefully pour broth over. Top with scallions and cilantro."},{"@type":"HowToStep","text":"Wipe out wok, pour in remaining 4 Tbsp. oil, and heat over high until just smoking. Add finely chopped garlic, gochugaru, sesame seeds, remaining 20 chiles, and remaining 1 tsp. whole Sichuan peppercorns and cook, stirring constantly, until fragrant, about 1 minute. Immediately pour over top of fish."}],"nutrition":""},{"id":6,"@context":"http://schema.org","@type":"Recipe","name":"Sichuan-Style Chicken with Rice Noodles","image":"https://assets.bonappetit.com/photos/57ace3191b334044149752bc/16:9/w_1000,c_limit/sichuan-style-chicken-with-rice-noodles.jpg","author":{"@type":"Person","name":"Bon Appétit"},"publisher":{"@type":"Organization","name":"Bon Appétit","logo":{"@type":"ImageObject","url":"https://www.bonappetit.com/images/logo-foodculture-tablet@1x.png","width":322,"height":56}},"datePublished":"2015-07-21T05:00:00.000-04:00","dateCreated":"2019-02-26T10:39:00.000-05:00","description":"You’ll find many of the ingredients for this chicken and noodles recipe in the Asian section of your supermarket or health food store. Stock up: We promise you’ll be making this well into fall.","aggregateRating":{"@type":"AggregateRating","ratingValue":"3.8","reviewCount":"31"},"recipeYield":"4  Servings","recipeIngredient":["1½ bunches scallions, divided","1 8-inch piece dried kombu","1 2-inch piece ginger, peeled, thinly sliced","3 star anise pods","1 tablespoon Sichuan peppercorns","¼ cup plus 2 tablespoons soy sauce","1 tablespoon kosher salt, plus more","1 3½&#8211;4-pound chicken","8 ounces dried thin rice noodles (not vermicelli)","2 teaspoons toasted sesame oil, divided","½ bunch Tuscan kale, tough stems removed, leaves very thinly sliced (about 3 cups)","Pinch of sugar","2 tablespoons unseasoned rice vinegar","1 tablespoon furikake seasoning, plus more for serving","Chili oil (for serving)","Furikake, a dried blend of seaweed, sesame seeds, fish flakes, salt, and other seasonings, can be found at Asian markets, some supermarkets, and online."],"recipeInstructions":[{"@type":"HowToStep","text":"Cut 1 bunch scallions into 1\" pieces; thinly slice remaining bunch of scallions and set aside. Bring 12 cups water to a brisk simmer in a large stockpot and add scallion pieces, kombu, ginger, star anise, Sichuan peppercorns, ¼ cup soy sauce, and 1 Tbsp. salt; cook until kombu is softened, 10–15 minutes."},{"@type":"HowToStep","text":"Add chicken to pot and reduce heat so liquid is at a very gentle simmer. Poach chicken, uncovered, until cooked through and an instant-read thermometer inserted into the thickest part of breast registers 160°, 40–45 minutes. Transfer chicken to a plate and let cool."},{"@type":"HowToStep","text":"Meanwhile, increase heat to medium-high and bring poaching liquid to a boil; cook until reduced by half, 30–45 minutes. Fish out scallions, ginger, and star anise from pot with a slotted spoon and discard. Add noodles to poaching liquid and cook according to package instructions. Drain and toss in a large bowl with 1 tsp. sesame oil."},{"@type":"HowToStep","text":"Combine kale, sugar, a pinch of salt, and remaining 1 tsp. sesame oil in a medium bowl and massage kale, rubbing between your fingers, until softened and shiny, about 30 seconds. Add vinegar, rice noodles, reserved sliced scallions, 1 Tbsp. furikake, and remaining 2 Tbsp. soy sauce and toss to combine; season with salt."},{"@type":"HowToStep","text":"Remove skin and bones from chicken; discard. Slice or shred meat. Serve with noodles, drizzled with chili oil and sprinkled with more furikake."},{"@type":"HowToStep","text":"Do Ahead: Chicken can be poached 1 day ahead; let cool, cover and chill chicken and liquid separately. Bring to room temperature before slicing. Noodle mixture can be made 3 hours ahead; store at room temperature. Moisten with more soy sauce and vinegar before serving."}],"nutrition":"Calories (kcal) 830 Fat (g) 43 Saturated Fat (g) 12 Cholesterol (mg) 195 Carbohydrates (g) 57 Dietary Fiber (g) 3 Total Sugars (g) 3 Protein (g) 51 Sodium (mg) 650","calories":"830"},{"id":7,"@context":"http://schema.org/","@type":"Recipe","mainEntityOfPage":"https://food52.com/recipes/13722-marcella-hazan-s-tomato-sauce-with-onion-butter","name":"Marcella Hazan&#39;s Tomato Sauce With Onion &amp;amp; Butter","image":["https://images.food52.com/K1UdQnnj8spzh47GtH2E-d4-vZQ=/1200x1200/947c8bc3-eb99-4be6-8219-b107929ba560--2019-0723_marcella-hazan-tomato-sauce-onion-butter_3x2_rocky-luten_047.jpg","https://images.food52.com/fkFMxXg4KRRe3NjQQzEp3vRJN6c=/1200x900/947c8bc3-eb99-4be6-8219-b107929ba560--2019-0723_marcella-hazan-tomato-sauce-onion-butter_3x2_rocky-luten_047.jpg","https://images.food52.com/x3w4q1iWOpPXiRJsqQN-mRco4wA=/1200x675/947c8bc3-eb99-4be6-8219-b107929ba560--2019-0723_marcella-hazan-tomato-sauce-onion-butter_3x2_rocky-luten_047.jpg"],"recipeCategory":"Dinner","recipeCuisine":"Italian","author":{"@type":"Person","name":"Genius Recipes","description":"Genius recipes surprise us and make us rethink cooking tropes. They&#39;re handed down by luminaries of the food world and become their legacy. They get us talking and change the way we cook. And, once we&#39;ve folded them into our repertoires, they make us feel pretty genius too. Watch for new Genius Recipes every Wednesday morning on our blog, dug up by Food52&#39;s Senior Editor Kristen Miglore.","url":"https://food52.com/users/31034-genius-recipes"},"datePublished":"2011-08-03 03:59:19 -0400","description":"The most famous tomato sauce on the internet, from Marcella Hazan&#39;s Essentials of Classic Italian Cooking. Editor&#39;s note: Marcella called for 2 cups of  tomatoes when using canned, but feel free to use a whole 28-ounce can (closer to 3 cups), if you like. You can scale up the butter and onion, if you like, or don&#39;t—it&#39;s genius either way.","recipeYield":"Serves 6, enough to sauce 1 to 1 1/2 pounds pasta","prepTime":"PT0H15M","cookTime":"PT0H45M","recipeInstructions":[{"@type":"HowToSection","name":"For the Sauce","itemListElement":[{"@type":"HowToStep","text":"Put either the prepared fresh tomatoes or the canned in a saucepan, add the butter, onion, and salt, and cook uncovered at a very slow, but steady simmer for about 45 minutes, or until it is thickened to your liking and the fat floats free from the tomato. "},{"@type":"HowToStep","text":"Stir from time to time, mashing up any large pieces of tomato with the back of a wooden spoon. "},{"@type":"HowToStep","text":"Taste and correct for salt. Before tossing with pasta, you may remove the onion (as Hazan recommended) and save for another use, but many opt to leave it in. Serve with freshly grated parmigiano-reggiano cheese for the table."}]},{"@type":"HowToSection","name":"Making Fresh Tomatoes Ready for Sauce","itemListElement":[{"@type":"HowToStep","text":"The blanching method: Plunge the tomatoes in boiling water for a minute or less. Drain them and, as soon as they are cool enough to handle, skin them, and cut them into coarse pieces."},{"@type":"HowToStep","text":"The freezing method (from David Tanis, via The Kitchn): Freeze tomatoes on a baking sheet until hard. Thaw again, either on the counter or under running water. Skin them and cut them into coarse pieces."},{"@type":"HowToStep","text":"The food mill method: Wash the tomatoes in cold water, cut them lengthwise in half, and put them in a covered saucepan. Turn on the heat to medium and cook for 10 minutes. Set a food mill fitted with the disk with the largest holes over a bowl. Transfer the tomatoes with any of their juices to the mill and puree."}]}],"recipeIngredient":["2 pounds fresh, ripe tomatoes, prepared as described below, or 2 cups canned imported Italian tomatoes, cut up, with their juice","5 tablespoons butter"," 1  medium onion, peeled and cut in half"," Salt to taste"," fresh, ripe plum tomatoes (or other varieties, if they are equally ripe and truly fruity, not watery)"],"commentCount":447,"aggregateRating":{"ratingCount":"64","ratingValue":"4.171875"},"keywords":"Condiment/Spread, Butter, Onion, Tomato, Vegetable, Summer, Make Ahead, 5 Ingredients or Fewer, Serves a Crowd, Vegetarian, Gluten-Free, Books"},{"id":8,"@context":"http://schema.org/","@type":"Recipe","name":"Crisp-Skinned Spatchcocked (Butterflied) Roast Turkey With Gravy Recipe","datePublished":"2012-11-06T10:54:30","dateModified":"2019-11-04T16:41:33","description":"Spatchcocking turkey cooks more evenly and more quickly than non-butterflied versions, for stunningly crisp skin and perfectly cooked white and dark meat. Bonus: this recipe makes a flavorful gravy from the pan drippings along the way.","image":["https://www.seriouseats.com/recipes/images/2015/04/20121108-spatchcock-turkey-food-lab-12.jpg","https://www.seriouseats.com/recipes/images/2015/04/20121108-spatchcock-turkey-food-lab-12-300x225.jpg","https://www.seriouseats.com/recipes/images/2015/04/20121108-spatchcock-turkey-food-lab-12-1500x1125.jpg","https://www.seriouseats.com/recipes/images/2015/04/20121108-spatchcock-turkey-food-lab-12-625x469.jpg","https://www.seriouseats.com/recipes/images/2015/04/20121108-spatchcock-turkey-food-lab-12-200x150.jpg","https://www.seriouseats.com/recipes/images/2015/04/20121108-spatchcock-turkey-food-lab-12-750x563.jpg"],"aggregateRating":{"@type":"AggregateRating","ratingValue":"4.72","ratingCount":"25"},"recipeCategory":["Turkey","Mains","Fall","Roasting","Thanksgiving","Winter"],"recipeYield":"Serves 10 to 12","totalTime":"PT02H00M","recipeIngredient":["3 large onions, roughly chopped (about 1 1/2 quarts)","3 large carrots, peeled and roughly chopped (about 1 quart)","4 stalks celery, roughly chopped (about 1 quart","12 thyme sprigs","1 whole turkey (12 to 14 pounds total), butterflied according to these instructions, backbone, neck, and giblets reserved","2 tablespoons vegetable oil","Kosher salt and freshly ground black pepper","1 1/2 quarts low-sodium homemade or store-bought chicken or turkey broth","2 bay leaves","3 tablespoons butter","4 tablespoons flour"],"recipeInstructions":[{"@type":"HowToStep","text":"Adjust oven rack to middle position and preheat oven to 450°F. Line a rimmed baking sheet or broiler pan with aluminum foil. Scatter 2/3rds of onions, carrots, celery and thyme sprigs across bottom of pan. Place slotted broiler rack or wire rack directly on top of vegetables."},{"@type":"HowToStep","text":"Pat turkey dry with paper towels and rub on all surfaces with 1 tablespoon oil. Season liberally on all surfaces with salt and black pepper (if using a brined, salted, or Kosher turkey, omit salting step, see note). Tuck wing tips behind back. Place turkey on top of rack, arranging so that it does not overlap the edges, pressing down on the breast bone to flatten the breasts slightly."},{"@type":"HowToStep","text":"Transfer turkey to oven and roast, rotating occasionally, until an instant read thermometer inserted into the deepest part of the breast registers 150°F, and the thighs register at least 165°F, about 80 minutes."},{"@type":"HowToStep","text":"While turkey roasts, make the gravy. Roughly chop the neck, backbone, and giblets. Heat remaining 1 tablespoon oil in a 3 quart saucepan over high heat until shimmering. Add chopped turkey parts and cook, stirring occasionally, until lightly browned, about 5 minutes. Add remaining onions, carrots, and celery and continue to cook, stirring occasionally, until vegetables start to soften and brown in spots, another 5 minutes. Add chicken stock, remaining thyme, and bay leaves. Bring to a boil and reduce to a bare simmer. Allow to cook 45 minutes, then strain through a fine mesh strainer into a 2 quart liquid measuring cup and discard solids. Skim off any fat from the surface of the broth."},{"@type":"HowToStep","text":"Melt butter over medium-high heat in a 2 quart saucepan. Add flour and cook, stirring constantly until flour is golden brown, about 3 minutes. Whisking constantly, add broth in a thin, steady stream until it it all incorporated. Bring to a boil, reduce to a simmer, and cook until reduced to about 1 quart, about 20 minutes longer. Season to taste with salt and pepper, cover, and keep gravy warm."},{"@type":"HowToStep","text":"When turkey is cooked, remove from oven and transfer rack to a new baking sheet. Allow to rest at room temperature for 20 minutes before carving. Carefully pour any collected juices from out of the roasting pan through a fine-mesh strainer into a liquid measuring cup. Skim off excess fat and dicard. Whisk juices into gravy."},{"@type":"HowToStep","text":"Carve turkey and serve with gravy"}],"author":{"@type":"Person","name":"J. Kenji López-Alt","jobTitle":"Chief Culinary Advisor","sameAs":["https://www.facebook.com/kenjilopezalt/","https://www.twitter.com/@kenjilopezalt"],"description":"J. Kenji López-Alt is a stay-at-home dad who moonlights as the Chief Culinary Consultant of Serious Eats and the Chef/Partner of Wursthall, a German-inspired California beer hall near his home in San Mateo. His first book,  The Food Lab: Better Home Cooking Through Science (based on his Serious Eats column of the same name) is a New York Times best-seller, recipient of a James Beard Award, and was named Cookbook of the Year in 2015 by the International Association of Culinary Professionals. Kenji's next project is a children’s book called Every Night is Pizza Night, to be released in 2020, followed by another big cookbook in 2021.","url":"https://www.seriouseats.com/user/profile/kenjilopezalt"},"keywords":"butterfly, essential, meat, poultry, roast, spatchcock, thanksgiving, turkey"},{"@context":"http://schema.org/","@type":"Recipe","name":"Lechon Liempo (Filipino-Style Roasted Pork Belly) Recipe","datePublished":"2012-05-25T09:05:43","dateModified":"2019-05-10T12:57:33","description":"Lechon liempo takes the tastiest portion of the swine—the belly—and gives it the slow-roasted treatment that results in succulent meat and crackling skin. It's enough to just roll up a piece of belly and put it on the spit, but I took the extra step of seasoning the inside with garlic paste.","image":["https://www.seriouseats.com/recipes/images/2012/05/20120522-207501-lechon-liempo-2.jpg","https://www.seriouseats.com/recipes/images/2012/05/20120522-207501-lechon-liempo-2-300x225.jpg","https://www.seriouseats.com/recipes/images/2012/05/20120522-207501-lechon-liempo-2-200x150.jpg"],"recipeCuisine":"Filipino","recipeCategory":["Pork","Mains"],"recipeYield":"serves 10-12","totalTime":"PT03H30M","recipeIngredient":["4 tablespoons olive oil ","2 tablespoons minced garlic ","2 tablespoons salt ","1 tablespoon white vinegar ","2 teaspoons freshly ground black pepper "," ","1 (5-lb) piece of pork belly, skin on","1 disposable foil pan"," ","Type of fire: three-zone split","Grill heat: medium"],"recipeInstructions":[{"@type":"HowToStep","text":"In a  small bowl, whisk together oil, garlic, salt, vinegar, and black pepper."},{"@type":"HowToStep","text":"Lay pork belly on a cutting board skin-side down. Score flesh diagonally about every 2-inches. Repeat in opposite direction, creating a diamond pattern. Spread garlic mixture evenly all over flesh."},{"@type":"HowToStep","text":"Roll pork into a cylinder and tie tightly with butcher twine about every inch."},{"@type":"HowToStep","text":"Light one chimney full of charcoal. When all the charcoal is lit and covered with gray ash, pour out and arrange the coals on either side of the charcoal grate and place a foil pan between the two piles of coals. Cover grill and allow to preheat for 5 minutes. Run spit of the rotisserie through middle of pork and secure ends with rotisserie forks. Place on the rotisserie, cover, and cook at medium heat until skin has darkened and crisped and pork registers 160ºF when an instant read thermometer is inserted into the thickest part of the meat, about 3 hours, replenishing coals to maintain temperature as needed. Remove from grill and let rest for 10 minutes. Remove spit, slice, and serve."}],"author":{"@type":"Person","name":"Joshua Bousel","jobTitle":"Contributor","sameAs":["http://www.facebook.com/meatwave","https://www.twitter.com/meatwave"],"description":"Josh has slow smoked and eaten so much pork, he's legally recognized as being part swine. He brings that love for barbecue, grilling, and cooking to Serious Eats as a regular recipe contributor.","url":"https://www.seriouseats.com/user/profile/josh"},"keywords":"filipino, grill, grilling, lechon, pig, pork, pork belly, roast pig, roasting"}]}